InformationRegisters/ITC_СтатусыЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ITC_СтатусыЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяВСтатусе</Name>
					<Comment>Время которое пробыла в этом статусе в часах</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ITC_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>ITC_Задача</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_JIRA</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_CODE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктирования</Name>
					<Comment>customfield_10415</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Comment>resolutiondate</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяОценка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Приоритет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Релиз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Релиз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спринт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Спринт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_СтатусыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сущность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тестировщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_ТипЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эпик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ITC_СтатусыЗадач/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьСтатусыНаСервере()
	яЗ = Новый Запрос;
	яЗ.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ITC_СтатусыЗадач.Дата) КАК Период,
	|	ITC_СтатусыЗадач.Задача КАК Задача
	|ПОМЕСТИТЬ ВТ_ЗагруженныеСтатусы
	|ИЗ
	|	РегистрСведений.ITC_СтатусыЗадач КАК ITC_СтатусыЗадач
	|
	|СГРУППИРОВАТЬ ПО
	|	ITC_СтатусыЗадач.Задача
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Задача
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ITC_Задача.JIRA_ID КАК JIRA_ID,
	|	ITC_Задача.JIRA КАК JIRA,
	|	ITC_Задача.Ссылка КАК Ссылка,
	|	ITC_Задача.ДатаСоздания КАК ДатаСоздания,
	|	ITC_Задача.Статус КАК Статус
	|ИЗ
	|	Справочник.ITC_Задача КАК ITC_Задача
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗагруженныеСтатусы КАК ВТ_ЗагруженныеСтатусы
	|		ПО ITC_Задача.Ссылка = ВТ_ЗагруженныеСтатусы.Задача
	|ГДЕ
	|	НЕ ITC_Задача.JIRA.Код ЕСТЬ NULL
	|	И ITC_Задача.ДатаСоздания > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И ВТ_ЗагруженныеСтатусы.Задача ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	JIRA,
	|	JIRA_ID
	|ИТОГИ ПО
	|	JIRA";
	
	яКешСтруктура = Новый Структура;
	
	яРезЗап = яЗ.Выполнить();
	яВыбСервер = яРезЗап.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "JIRA");
	// Отбираем сервера JIRA
	Пока яВыбСервер.Следующий() Цикл
		яПодключение = ITC_JIRA.ДанныеПодключения(яВыбСервер.JIRA);
		
		// Отбираем задачи для этого сервера
		яВыбЗадача = яВыбСервер.Выбрать();
		Пока яВыбЗадача.Следующий() Цикл
			яКоннект = ITC_JIRA.СоздатьЗапросИПодключение(яПодключение, "/issue/" + яВыбЗадача.JIRA_ID + "?expand=changelog&maxresult=500");
			
			// Получаем данные по задаче с учётом изменений
			Попытка
				HTTPОтвет = яКоннект.Соединение.Получить(яКоннект.Запрос); //GET запрос
				яСтрокаОтвет = HTTPОтвет.ПолучитьТелоКакСтроку();
				
				Если HTTPОтвет.КодСостояния > 299 Тогда
					яОписаниеОшибки = "Код состояния: " + HTTPОтвет.КодСостояния + ". Данные не получены!";
				КонецЕсли;
			Исключение
				яОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				яОписаниеОшибки = "Ошибка при выполнении HTTP запроса: " + яОписаниеОшибки;
			КонецПопытки;

			// Парсим данные
			Чтение = Новый ЧтениеJSON;
			Чтение.УстановитьСтроку(яСтрокаОтвет);
			ПолученныеДанные = ПрочитатьJSON(Чтение, Истина);
			Чтение.Закрыть();
			
			яПервоеИзменение = Истина;
			яНачальныйСтатус = яВыбЗадача.Статус;
			
			яЛог = ПолученныеДанные["changelog"];
			Если яЛог <> Неопределено Тогда
				яИстория = яЛог["histories"];				
				
				// Перебираем историю изменений и ищем события изменения статуса
				Для Каждого яСобытие Из яИстория Цикл
					яМенялсяСтатус = Ложь;
					Для Каждого яПоле Из яСобытие["items"] Цикл
						Если яПоле["field"] = "status" Тогда
							яМенялсяСтатус = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если яМенялсяСтатус Тогда
						Если яПервоеИзменение Тогда
							яПервоеИзменение = Ложь;
							яНачальныйСтатус = ITC_JIRA.ПолучитьОбъектJIRA(яВыбСервер.JIRA, яПоле["from"], "ITC_СтатусыЗадач", Ложь);
							ITC_JIRA.ОбновитьИсториюСтатуса(яВыбЗадача.Ссылка
							, яНачальныйСтатус
							, яВыбЗадача.ДатаСоздания);
						КонецЕсли;
						
						яДатаСтатуса = ITC_JIRA.ПолучитьДату(яСобытие["created"]);
						яСтатус = ITC_JIRA.ПолучитьОбъектJIRA(яВыбСервер.JIRA, яПоле["to"], "ITC_СтатусыЗадач", Ложь);
						
						ITC_JIRA.ОбновитьИсториюСтатуса(яВыбЗадача.Ссылка
						, яСтатус
						, яДатаСтатуса);
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			//Если изменений статуса не было, создаём запись в регистре всё равно
			Если яПервоеИзменение Тогда
				ITC_JIRA.ОбновитьИсториюСтатуса(яВыбЗадача.Ссылка
				, яНачальныйСтатус
				, яВыбЗадача.ДатаСоздания);				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтатусы(Команда)
	ЗагрузитьСтатусыНаСервере();
КонецПроцедуры
